ankuns/nrfx/bsp/stable/mdk/gcc_startup_nrf7140_dppr.S
    .weak   UserSoftware_Handler
    .type   UserSoftware_Handler, %function
UserSoftware_Handler:
    j       .
    .size   UserSoftware_Handler, . - UserSoftware_Handler


    .weak   SuperVisorSoftware_Handler
    .type   SuperVisorSoftware_Handler, %function
SuperVisorSoftware_Handler:
    j       .
    .size   SuperVisorSoftware_Handler, . - SuperVisorSoftware_Handler


    .weak   MachineSoftware_Handler
    .type   MachineSoftware_Handler, %function
MachineSoftware_Handler:
    j       .
    .size   MachineSoftware_Handler, . - MachineSoftware_Handler


    .weak   UserTimer_Handler
    .type   UserTimer_Handler, %function
UserTimer_Handler:
    j       .
    .size   UserTimer_Handler, . - UserTimer_Handler


    .weak   SuperVisorTimer_Handler
    .type   SuperVisorTimer_Handler, %function
SuperVisorTimer_Handler:
    j       .
    .size   SuperVisorTimer_Handler, . - SuperVisorTimer_Handler


    .weak   MachineTimer_Handler
    .type   MachineTimer_Handler, %function
MachineTimer_Handler:
    j       .
    .size   MachineTimer_Handler, . - MachineTimer_Handler


    .weak   UserExternal_Handler
    .type   UserExternal_Handler, %function
UserExternal_Handler:
    j       .
    .size   UserExternal_Handler, . - UserExternal_Handler


    .weak   SuperVisorExternal_Handler
    .type   SuperVisorExternal_Handler, %function
SuperVisorExternal_Handler:
    j       .
    .size   SuperVisorExternal_Handler, . - SuperVisorExternal_Handler


    .weak   MachineExternal_Handler
    .type   MachineExternal_Handler, %function
MachineExternal_Handler:
    j       .
    .size   MachineExternal_Handler, . - MachineExternal_Handler


    .weak   CLICSoftware_Handler
    .type   CLICSoftware_Handler, %function
CLICSoftware_Handler:
    j       .
    .size   CLICSoftware_Handler, . - CLICSoftware_Handler


/* IRQ Handlers */

    .globl  Default_Handler
    .type   Default_Handler, %function
Default_Handler:
    j       .
    .size   Default_Handler, . - Default_Handler

    .macro  IRQ handler
    .weak   \handler
    .set    \handler, Default_Handler
    .endm

    IRQ  MPC_IRQHandler
    IRQ  MVDMA_IRQHandler
    IRQ  AXONS_IRQHandler
    IRQ  VPRCLIC_8_IRQHandler
    IRQ  VPRCLIC_9_IRQHandler
    IRQ  VPRCLIC_10_IRQHandler
    IRQ  VPRCLIC_11_IRQHandler
    IRQ  VPRCLIC_12_IRQHandler
    IRQ  VPRCLIC_13_IRQHandler
    IRQ  VPRCLIC_14_IRQHandler
    IRQ  VPRCLIC_15_IRQHandler
    IRQ  VPRTIM_IRQHandler
    IRQ  WDT_IRQHandler
    IRQ  IPCT_0_IRQHandler
    IRQ  IPCT_1_IRQHandler
    IRQ  BELLBOARD_ML_0_IRQHandler
    IRQ  BELLBOARD_ML_1_IRQHandler
    IRQ  BELLBOARD_ML_2_IRQHandler
    IRQ  BELLBOARD_ML_3_IRQHandler
    IRQ  GPIOTE130_0_IRQHandler
    IRQ  GPIOTE130_1_IRQHandler
    IRQ  GRTC_0_IRQHandler
    IRQ  GRTC_1_IRQHandler
    IRQ  GRTC_2_IRQHandler
    IRQ  GSI_IRQHandler
    IRQ  DISPC_0_IRQHandler
    IRQ  DISPC_1_IRQHandler
    IRQ  DISPC_2_IRQHandler
    IRQ  GPU_IRQHandler
    IRQ  TBM_IRQHandler
    IRQ  USBHS_IRQHandler
    IRQ  MRAMC110_IRQHandler
    IRQ  MRAMC111_IRQHandler
    IRQ  EXMIF_IRQHandler
    IRQ  OTPC_IRQHandler
    IRQ  VPR120_IRQHandler
    IRQ  IPCT120_0_IRQHandler
    IRQ  I3C120_IRQHandler
    IRQ  VPR121_IRQHandler
    IRQ  QSPI120_IRQHandler
    IRQ  CAN120_IRQHandler
    IRQ  MVDMA120_IRQHandler
    IRQ  CAN121_IRQHandler
    IRQ  MVDMA121_IRQHandler
    IRQ  I3C121_IRQHandler
    IRQ  QSPI121_IRQHandler
    IRQ  TIMER120_IRQHandler
    IRQ  TIMER121_IRQHandler
    IRQ  PWM120_IRQHandler
    IRQ  SPIS120_IRQHandler
    IRQ  SPIM120_UARTE120_IRQHandler
    IRQ  SPIM121_IRQHandler
    IRQ  SPIM122_IRQHandler
    IRQ  SPIM123_IRQHandler
    IRQ  VPR130_IRQHandler
    IRQ  IPCT130_0_IRQHandler
    IRQ  RTC130_IRQHandler
    IRQ  RTC131_IRQHandler
    IRQ  WDT131_IRQHandler
    IRQ  WDT132_IRQHandler
    IRQ  EGU130_IRQHandler
    IRQ  RESETHUB_IRQHandler
    IRQ  AUDIOPLL_IRQHandler
    IRQ  USBHSPLL_IRQHandler
    IRQ  VREGUSB_IRQHandler
    IRQ  AUDIOPLLPM_IRQHandler
    IRQ  SAADC_IRQHandler
    IRQ  COMP_LPCOMP_IRQHandler
    IRQ  TEMP_IRQHandler
    IRQ  NFCT_IRQHandler
    IRQ  TDM130_IRQHandler
    IRQ  QDEC130_IRQHandler
    IRQ  QDEC131_IRQHandler
    IRQ  SIMIF130_IRQHandler
    IRQ  TDM131_IRQHandler
    IRQ  TDM132_IRQHandler
    IRQ  TIMER130_IRQHandler
    IRQ  TIMER131_IRQHandler
    IRQ  PWM130_IRQHandler
    IRQ  SERIAL0_IRQHandler
    IRQ  SERIAL1_IRQHandler
    IRQ  PDM130_IRQHandler
    IRQ  TIMER132_IRQHandler
    IRQ  TIMER133_IRQHandler
    IRQ  PWM131_IRQHandler
    IRQ  SERIAL2_IRQHandler
    IRQ  SERIAL3_IRQHandler
    IRQ  PDM131_IRQHandler
    IRQ  TIMER134_IRQHandler
    IRQ  TIMER135_IRQHandler
    IRQ  PWM132_IRQHandler
    IRQ  SERIAL4_IRQHandler
    IRQ  SERIAL5_IRQHandler
    IRQ  PDM132_IRQHandler
    IRQ  TIMER136_IRQHandler
    IRQ  TIMER137_IRQHandler
    IRQ  PWM133_IRQHandler
    IRQ  SERIAL6_IRQHandler
    IRQ  SERIAL7_IRQHandler
    IRQ  PDM133_IRQHandler

  .end
